In [1]:
import numpy as np
import pandas as pd

1.	Write a Pandas program to create and display a one-dimensional array-like object containing an array of data using Pandas module

In [2]:
a=pd.Series([1,2,3,4])
print(a)

0    1
1    2
2    3
3    4
dtype: int64

2.	Write a pandas program to convert a pandas module series to python list.

In [7]:
s=list(a)
print(s)
a.tolist()
# print(a)

[1, 2, 3, 4]

[1, 2, 3, 4]

3.	Write a pandas program to add, subtract, multiple and divide two pandas series.

In [9]:
l=pd.Series([1,2,3,4])
m=pd.Series([5,6,7,8])
print(m-l)
print(l+m)
print(l*m)
print(l/m)

0    4
1    4
2    4
3    4
dtype: int64
0     6
1     8
2    10
3    12
dtype: int64
0     5
1    12
2    21
3    32
dtype: int64
0    0.200000
1    0.333333
2    0.428571
3    0.500000
dtype: float64

4.	Write a Pandas program to convert all the string values to upper, lower cases in a given pandas series. Also find the length of the string values.

In [10]:
d=pd.Series(['Apple','baNana','GuaVa'])
print(d.str.upper())
print(d.str.lower())
print(d.str.len())

0     APPLE
1    BANANA
2     GUAVA
dtype: object
0     apple
1    banana
2     guava
dtype: object
0    5
1    6
2    5
dtype: int64

5.	Write a Pandas program to remove whitespaces, left sided whitespaces and right sided whitespaces of the string values of a given pandas series

In [11]:
f=pd.Index(['   ali  ','shoheb    ','     akram'])
f.str.strip()

Index(['ali', 'shoheb', 'akram'], dtype='object')

6.	Write a Pandas program to create and display a DataFrame consist of student name, father name , mobile number as columns and register number as index.

In [13]:
data={'Name':['Ali','Shoheb','Akram'],
     'Father Name':['Shabber','Karimulla','Karimulla'],
     'Mobile Number':[9848711015,9347235528,8008129519]}
label=["Y20CS164",'Y20CS167','Y20CS162']
df=pd.DataFrame(data,index=label)
df

            Name Father Name  Mobile Number
Y20CS164     Ali     Shabber     9848711015
Y20CS167  Shoheb   Karimulla     9347235528
Y20CS162   Akram   Karimulla     8008129519

7.	Write a Pandas program to get list from DataFrame column headers

In [14]:
df.columns.values

array(['Name', 'Father Name', 'Mobile Number'], dtype=object)

8.	Write a Pandas program to change the name of the student.

In [15]:
df['Name']=df['Name'].replace('Akram','Uday')
df

            Name Father Name  Mobile Number
Y20CS164     Ali     Shabber     9848711015
Y20CS167  Shoheb   Karimulla     9347235528
Y20CS162    Uday   Karimulla     8008129519

9.	Write a Pandas program to insert a new column “grade” in existing DataFrame

In [18]:
df['Grade']=[8.5,8.7,9.2]
df

            Name Father Name  Mobile Number  Grade
Y20CS164     Ali     Shabber     9848711015    8.5
Y20CS167  Shoheb   Karimulla     9347235528    8.7
Y20CS162   Akram   Karimulla     8008129519    9.2

.  Write a pandas program to create and display a dataframe from a specified dictionary data which has the index labels.

In [19]:
data={'Name':['Ali','Shoheb','Akram'],
     'Father Name':['Shabber','Karimulla','Karimulla'],
     'Mobile Number':[9848711015,9347235528,8008129519]}
label=["Y20CS164",'Y20CS167','Y20CS162']
df=pd.DataFrame(data,index=label)
df

            Name Father Name  Mobile Number
Y20CS164     Ali     Shabber     9848711015
Y20CS167  Shoheb   Karimulla     9347235528
Y20CS162   Akram   Karimulla     8008129519